app/Http/Controllers/Patient_piaController.php

    public function pia_seguimiento(CreatePatient_piaRequest $request)
    {


        if ($request->tipo_pia == 'Seguimiento') {
            $patientPiaLast = Patient_pia::where('tipo_pia', 'Seguimiento')
                ->where('patient_id', $request->id)
                ->orderBy('created_at', 'desc')->first();
---
select * from `patient_pias` where `tipo_pia` = 'Seguimiento' and `patient_id` = '7' and `patient_pias`.`deleted_at` is null order by `created_at` desc limit 1