app/Http/Controllers/Patient_piaController.php

    public function update($id, UpdatePatient_piaRequest $request)
    {
        $patientPia = $this->patientPiaRepository->find($id);

        if (empty($patientPia)) {
            Flash::error('Patient Pia not found');
            return redirect(route('patientPias.index'));
        }

        $patientPia = $this->patientPiaRepository->update($request->all(), $id);
---
select * from `patients` where `patients`.`id` = 7 and `patients`.`deleted_at` is null limit 1
update `patient_pias` set `url_pia` = 'patient_documents/pia_documents7/FTsy1aHh7aUV09g6GmTdYJ9vPFFgxAfgQkTickPI.zip', `url_recepcion` = 'patient_documents/pia_documents7/pDTq2ZLD0nMcjElBdw1t6QQIqNAveotbzUiig0D6.pdf', `patient_pias`.`updated_at` = '2020-01-18 09:26:37' where `id` = 9