app/Http/Controllers/PatientController.php

select * from `workers` where `workers`.`deleted_at` is null
---
    public function create()
    {
        $workers = Worker::all();

select * from `workers` where `workers`.`deleted_at` is null
select * from `patient_services` where `patient_id` = '1' and `patient_services`.`deleted_at` is null
---
    public function edit($id)
    {
        $patient = $this->patientRepository->find($id);
        $workers = Worker::all();
        $services = Patient_service::where('patient_id', $id)->get();